NordicSemiconductor/nRF5-SDK-for-Mesh/models/model_spec/light_lc/src/light_lc_mc.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "light_lc_mc.h"

#include "nrf_mesh_config_app.h"

#include "mesh_opt.h"

#include "light_lc_common.h"
#include "light_lc_state_utils.h"

typedef struct
{
    uint8_t lc_mode;
    uint8_t lc_occ_mode;
    uint8_t lc_light_onoff;
    uint32_t lc_pr_luxlevel_on;
    uint32_t lc_pr_luxlevel_prolong;
    uint32_t lc_pr_luxlevel_standby;
    uint16_t lc_pr_lightness_on;
    uint16_t lc_pr_lightness_prolong;
    uint16_t lc_pr_lightness_standby;
    uint8_t lc_pr_regulator_accuracy;
    float lc_pr_regulator_kid;
    float lc_pr_regulator_kiu;
    float lc_pr_regulator_kpd;
    float lc_pr_regulator_kpu;
    uint32_t lc_pr_time_fade;
    uint32_t lc_pr_time_fade_on;
    uint32_t lc_pr_time_fade_standby_auto;
    uint32_t lc_pr_time_fade_standby_manual;
    uint32_t lc_pr_time_occupancy_delay;
    uint32_t lc_pr_time_prolong;
    uint32_t lc_pr_time_run_on;
} lc_flash_storage_state_t;

/* Setter and getter declarations.
 * A setter or a getter, respectively, stores or retrieves a state variable value from
 * a primary memory location defined by a LC setup server instance.
*/
static uint32_t lc_mode_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_mode_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_occ_mode_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_occ_mode_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_light_onoff_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_light_onoff_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_luxlevel_on_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_luxlevel_on_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_luxlevel_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_luxlevel_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_luxlevel_standby_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_luxlevel_standby_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_lightness_on_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_lightness_on_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_lightness_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_lightness_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_lightness_standby_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_lightness_standby_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_regulator_accuracy_state_setter(mesh_config_entry_id_t id,
                                                      const void * p_entry);
static void     lc_pr_regulator_accuracy_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_regulator_kid_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_regulator_kid_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_regulator_kiu_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_regulator_kiu_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_regulator_kpd_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_regulator_kpd_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_regulator_kpu_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_regulator_kpu_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_time_fade_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_time_fade_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_time_fade_on_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_time_fade_on_state_getter(mesh_config_entry_id_t id, void * p_entry);

