NordicSemiconductor/nRF5-SDK-for-Mesh/models/model_spec/light_lc/src/light_lc_mc.c
static uint32_t lc_pr_time_fade_standby_auto_state_setter(mesh_config_entry_id_t id,
                                                          const void * p_entry);
static void     lc_pr_time_fade_standby_auto_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_time_fade_standby_manual_state_setter(mesh_config_entry_id_t id,
                                                            const void * p_entry);
static void     lc_pr_time_fade_standby_manual_state_getter(mesh_config_entry_id_t id,
                                                            void * p_entry);

static uint32_t lc_pr_time_occupancy_delay_state_setter(mesh_config_entry_id_t id,
                                                        const void * p_entry);
static void     lc_pr_time_occupancy_delay_state_getter(mesh_config_entry_id_t id, void * p_entry);


static uint32_t lc_pr_time_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_time_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry);

static uint32_t lc_pr_time_run_on_state_setter(mesh_config_entry_id_t id, const void * p_entry);
static void     lc_pr_time_run_on_state_getter(mesh_config_entry_id_t id, void * p_entry);

/* A mesh config entry associates a state variable with LIGHT_LC_SETUP_SERVER_INSTANCES_MAX
 * file locations each identified by a unique entry ID. Given an integer i in
 * [0, LIGHT_LC_SETUP_SERVER_INSTANCES_MAX-1], base ID + i identifies the i-th instance. The
 * entry also associates the base entry ID with previously declared setter and
 * getter functions.
 */

MESH_CONFIG_ENTRY(m_lc_mode_entry,
                  LIGHT_LC_MODE_EID,      /* The base entry id */
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,   /* The number of instances. */
                  sizeof(uint8_t),       /* The size of an instance. */
                  lc_mode_state_setter,  /* Stores a value in primary memory. */
                  lc_mode_state_getter,  /* Retrieves a value from primary memory. */
                  NULL,                  /* No need for a delete callback */
                  true);                 /* There is a default value */

MESH_CONFIG_ENTRY(m_lc_occ_mode_entry,
                  LIGHT_LC_OCC_MODE_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint8_t),
                  lc_occ_mode_state_setter,
                  lc_occ_mode_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_light_onoff_entry,
                  LIGHT_LC_LIGHT_ONOFF_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint8_t),
                  lc_light_onoff_state_setter,
                  lc_light_onoff_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_luxlevel_on_entry,
                  LIGHT_LC_PR_LUXLEVEL_ON_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_luxlevel_on_state_setter,
                  lc_pr_luxlevel_on_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_luxlevel_prolong_entry,
                  LIGHT_LC_PR_LUXLEVEL_PROLONG_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_luxlevel_prolong_state_setter,
                  lc_pr_luxlevel_prolong_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_luxlevel_standby_entry,
                  LIGHT_LC_PR_LUXLEVEL_STANDBY_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_luxlevel_standby_state_setter,
                  lc_pr_luxlevel_standby_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_lightness_on_entry,
                  LIGHT_LC_PR_LIGHTNESS_ON_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint16_t),
                  lc_pr_lightness_on_state_setter,
                  lc_pr_lightness_on_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_lightness_prolong_entry,
                  LIGHT_LC_PR_LIGHTNESS_PROLONG_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint16_t),
                  lc_pr_lightness_prolong_state_setter,
                  lc_pr_lightness_prolong_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_lightness_standby_entry,
                  LIGHT_LC_PR_LIGHTNESS_STANDBY_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint16_t),
                  lc_pr_lightness_standby_state_setter,
                  lc_pr_lightness_standby_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_regulator_accuracy_entry,
                  LIGHT_LC_PR_REGULATOR_ACCURACY_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint8_t),
                  lc_pr_regulator_accuracy_state_setter,
                  lc_pr_regulator_accuracy_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_regulator_kid_entry,
                  LIGHT_LC_PR_REGULATOR_KID_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(float),
                  lc_pr_regulator_kid_state_setter,
                  lc_pr_regulator_kid_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_regulator_kiu_entry,
                  LIGHT_LC_PR_REGULATOR_KIU_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(float),
                  lc_pr_regulator_kiu_state_setter,
                  lc_pr_regulator_kiu_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_regulator_kpd_entry,
                  LIGHT_LC_PR_REGULATOR_KPD_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(float),
                  lc_pr_regulator_kpd_state_setter,
                  lc_pr_regulator_kpd_state_getter,
                  NULL,
                  true);

