NordicSemiconductor/nRF5-SDK-for-Mesh/models/model_spec/light_lc/src/light_lc_mc.c
MESH_CONFIG_ENTRY(m_lc_pr_regulator_kpu_entry,
                  LIGHT_LC_PR_REGULATOR_KPU_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(float),
                  lc_pr_regulator_kpu_state_setter,
                  lc_pr_regulator_kpu_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_fade_entry,
                  LIGHT_LC_PR_TIME_FADE_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_fade_state_setter,
                  lc_pr_time_fade_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_fade_on_entry,
                  LIGHT_LC_PR_TIME_FADE_ON_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_fade_on_state_setter,
                  lc_pr_time_fade_on_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_fade_standby_auto_entry,
                  LIGHT_LC_PR_TIME_FADE_STANDBY_AUTO_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_fade_standby_auto_state_setter,
                  lc_pr_time_fade_standby_auto_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_fade_standby_manual_entry,
                  LIGHT_LC_PR_TIME_FADE_STANDBY_MANUAL_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_fade_standby_manual_state_setter,
                  lc_pr_time_fade_standby_manual_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_occupancy_delay_entry,
                  LIGHT_LC_PR_TIME_OCCUPANCY_DELAY_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_occupancy_delay_state_setter,
                  lc_pr_time_occupancy_delay_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_prolong_entry,
                  LIGHT_LC_PR_TIME_PROLONG_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_prolong_state_setter,
                  lc_pr_time_prolong_state_getter,
                  NULL,
                  true);

MESH_CONFIG_ENTRY(m_lc_pr_time_run_on_entry,
                  LIGHT_LC_PR_TIME_RUN_ON_EID,
                  LIGHT_LC_SETUP_SERVER_INSTANCES_MAX,
                  sizeof(uint32_t),
                  lc_pr_time_run_on_state_setter,
                  lc_pr_time_run_on_state_getter,
                  NULL,
                  true);

/* An array for mapping from a handle to a state pointer.
 */
static lc_flash_storage_state_t m_state_contexts[LIGHT_LC_SETUP_SERVER_INSTANCES_MAX];
static uint8_t m_next_handle;

static lc_flash_storage_state_t * context_get(uint8_t i)
{
    NRF_MESH_ASSERT(i < m_next_handle);
    return &m_state_contexts[i];
}

/*  Maps from (ID record, ID record base)-pairs to state pointer.
 */
static lc_flash_storage_state_t * model_context_get(uint16_t address, uint16_t base)
{
    NRF_MESH_ASSERT(base <= address);
    return context_get(address - base);
}

static void state_contexts_default_set(uint8_t handle)
{
    m_state_contexts[handle].lc_mode = LIGHT_LC_DEFAULT_MODE;
    m_state_contexts[handle].lc_occ_mode = LIGHT_LC_DEFAULT_OCC_MODE;
    m_state_contexts[handle].lc_light_onoff = LIGHT_LC_DEFAULT_LIGHT_ONOFF;
    m_state_contexts[handle].lc_pr_luxlevel_on = LIGHT_LC_DEFAULT_PR_LUXLEVEL_ON;
    m_state_contexts[handle].lc_pr_luxlevel_prolong = LIGHT_LC_DEFAULT_PR_LUXLEVEL_PROLONG;
    m_state_contexts[handle].lc_pr_luxlevel_standby = LIGHT_LC_DEFAULT_PR_LUXLEVEL_STANDBY;
    m_state_contexts[handle].lc_pr_lightness_on = LIGHT_LC_DEFAULT_PR_LIGHTNESS_ON;
    m_state_contexts[handle].lc_pr_lightness_prolong = LIGHT_LC_DEFAULT_PR_LIGHTNESS_PROLONG;
    m_state_contexts[handle].lc_pr_lightness_standby = LIGHT_LC_DEFAULT_PR_LIGHTNESS_STANDBY;
    m_state_contexts[handle].lc_pr_regulator_accuracy = LIGHT_LC_DEFAULT_PR_REGULATOR_ACCURACY;
    m_state_contexts[handle].lc_pr_regulator_kid = LIGHT_LC_DEFAULT_PR_REGULATOR_KID;
    m_state_contexts[handle].lc_pr_regulator_kiu = LIGHT_LC_DEFAULT_PR_REGULATOR_KIU;
    m_state_contexts[handle].lc_pr_regulator_kpd = LIGHT_LC_DEFAULT_PR_REGULATOR_KPD;
    m_state_contexts[handle].lc_pr_regulator_kpu = LIGHT_LC_DEFAULT_PR_REGULATOR_KPU;
    m_state_contexts[handle].lc_pr_time_fade = LIGHT_LC_DEFAULT_PR_TIME_FADE_MS;
    m_state_contexts[handle].lc_pr_time_fade_on = LIGHT_LC_DEFAULT_PR_TIME_FADE_ON_MS;
    m_state_contexts[handle].lc_pr_time_fade_standby_auto = LIGHT_LC_DEFAULT_PR_TIME_FADE_STANDBY_AUTO_MS;
    m_state_contexts[handle].lc_pr_time_fade_standby_manual = LIGHT_LC_DEFAULT_PR_TIME_FADE_STANDBY_MANUAL_MS;
    m_state_contexts[handle].lc_pr_time_occupancy_delay = LIGHT_LC_DEFAULT_PR_TIME_OCCUPANCY_DELAY_MS;
    m_state_contexts[handle].lc_pr_time_prolong = LIGHT_LC_DEFAULT_PR_TIME_PROLONG_MS;
    m_state_contexts[handle].lc_pr_time_run_on = LIGHT_LC_DEFAULT_PR_TIME_RUN_ON_MS;
}

static void state_contexts_all_default_set()
{
    for (uint8_t i = 0; i < ARRAY_SIZE(m_state_contexts); i++)
    {
        state_contexts_default_set(i);
    }
}

static void lc_flash_storage_config_clear(void)
{
    const struct {
        const mesh_config_entry_id_t * const id;
        const uint16_t start;
    } entries[] = {
        {&LIGHT_LC_MODE_EID, LIGHT_LC_MODE_EID_START},
        {&LIGHT_LC_OCC_MODE_EID, LIGHT_LC_OCC_MODE_EID_START},
        {&LIGHT_LC_LIGHT_ONOFF_EID, LIGHT_LC_LIGHT_ONOFF_EID_START},
        {&LIGHT_LC_PR_LUXLEVEL_ON_EID, LIGHT_LC_PR_LUXLEVEL_ON_EID_START},
        {&LIGHT_LC_PR_LUXLEVEL_PROLONG_EID, LIGHT_LC_PR_LUXLEVEL_PROLONG_EID_START},
        {&LIGHT_LC_PR_LUXLEVEL_STANDBY_EID, LIGHT_LC_PR_LUXLEVEL_STANDBY_EID_START},
        {&LIGHT_LC_PR_LIGHTNESS_ON_EID, LIGHT_LC_PR_LIGHTNESS_ON_EID_START},
        {&LIGHT_LC_PR_LIGHTNESS_PROLONG_EID, LIGHT_LC_PR_LIGHTNESS_PROLONG_EID_START},
        {&LIGHT_LC_PR_LIGHTNESS_STANDBY_EID, LIGHT_LC_PR_LIGHTNESS_STANDBY_EID_START},
        {&LIGHT_LC_PR_REGULATOR_ACCURACY_EID, LIGHT_LC_PR_REGULATOR_ACCURACY_EID_START},
        {&LIGHT_LC_PR_REGULATOR_KID_EID, LIGHT_LC_PR_REGULATOR_KID_EID_START},
        {&LIGHT_LC_PR_REGULATOR_KIU_EID, LIGHT_LC_PR_REGULATOR_KIU_EID_START},
        {&LIGHT_LC_PR_REGULATOR_KPD_EID, LIGHT_LC_PR_REGULATOR_KPD_EID_START},
        {&LIGHT_LC_PR_REGULATOR_KPU_EID, LIGHT_LC_PR_REGULATOR_KPU_EID_START},
        {&LIGHT_LC_PR_TIME_FADE_EID, LIGHT_LC_PR_TIME_FADE_EID_START},
        {&LIGHT_LC_PR_TIME_FADE_ON_EID, LIGHT_LC_PR_TIME_FADE_ON_EID_START},
        {&LIGHT_LC_PR_TIME_FADE_STANDBY_AUTO_EID, LIGHT_LC_PR_TIME_FADE_STANDBY_AUTO_EID_START},
        {&LIGHT_LC_PR_TIME_FADE_STANDBY_MANUAL_EID, LIGHT_LC_PR_TIME_FADE_STANDBY_MANUAL_EID_START},
        {&LIGHT_LC_PR_TIME_OCCUPANCY_DELAY_EID, LIGHT_LC_PR_TIME_OCCUPANCY_DELAY_EID_START},
        {&LIGHT_LC_PR_TIME_PROLONG_EID, LIGHT_LC_PR_TIME_PROLONG_EID_START},
        {&LIGHT_LC_PR_TIME_RUN_ON_EID, LIGHT_LC_PR_TIME_RUN_ON_EID_START},
    };

    state_contexts_all_default_set();

