NordicSemiconductor/nRF5-SDK-for-Mesh/models/model_spec/light_lc/src/light_lc_mc.c
    for (uint16_t j=0; j < ARRAY_SIZE(entries); j++)
    {
        mesh_config_entry_id_t id = *entries[j].id;
        for (uint8_t i = 0; i < m_next_handle; i++)
        {
            id.record = entries[j].start + i;
            (void) mesh_config_entry_delete(id);
        }
    }
}

static uint32_t lc_mode_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint8_t * p_value = (const uint8_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_MODE_EID_START)->lc_mode = *p_value;
    return NRF_SUCCESS;
}

static void lc_mode_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint8_t * p_value = (uint8_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_MODE_EID_START)->lc_mode;
}

static uint32_t lc_occ_mode_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint8_t * p_value = (const uint8_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_OCC_MODE_EID_START)->lc_occ_mode = *p_value;
    return NRF_SUCCESS;
}

static void lc_occ_mode_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint8_t * p_value = (uint8_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_OCC_MODE_EID_START)->lc_occ_mode;
}

static uint32_t lc_light_onoff_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint8_t * p_value = (const uint8_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_LIGHT_ONOFF_EID_START)->lc_light_onoff = *p_value;
    return NRF_SUCCESS;
}

static void lc_light_onoff_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint8_t * p_value = (uint8_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_LIGHT_ONOFF_EID_START)->lc_light_onoff;
}

static uint32_t lc_pr_luxlevel_on_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_ON_EID_START)->lc_pr_luxlevel_on = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_luxlevel_on_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_ON_EID_START)->lc_pr_luxlevel_on;
}

static uint32_t lc_pr_luxlevel_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_PROLONG_EID_START)->lc_pr_luxlevel_prolong = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_luxlevel_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_PROLONG_EID_START)->lc_pr_luxlevel_prolong;
}

static uint32_t lc_pr_luxlevel_standby_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_STANDBY_EID_START)->lc_pr_luxlevel_standby = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_luxlevel_standby_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LUXLEVEL_STANDBY_EID_START)->lc_pr_luxlevel_standby;
}

static uint32_t lc_pr_lightness_on_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint16_t * p_value = (const uint16_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_ON_EID_START)->lc_pr_lightness_on = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_lightness_on_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint16_t * p_value = (uint16_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_ON_EID_START)->lc_pr_lightness_on;
}

static uint32_t lc_pr_lightness_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint16_t * p_value = (const uint16_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_PROLONG_EID_START)->lc_pr_lightness_prolong = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_lightness_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint16_t * p_value = (uint16_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_PROLONG_EID_START)->lc_pr_lightness_prolong;
}


static uint32_t lc_pr_lightness_standby_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint16_t * p_value = (const uint16_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_STANDBY_EID_START)->lc_pr_lightness_standby = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_lightness_standby_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint16_t * p_value = (uint16_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_LIGHTNESS_STANDBY_EID_START)->lc_pr_lightness_standby;
}

static uint32_t lc_pr_regulator_accuracy_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint8_t * p_value = (const uint8_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_REGULATOR_ACCURACY_EID_START)->lc_pr_regulator_accuracy = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_regulator_accuracy_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint8_t * p_value = (uint8_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_REGULATOR_ACCURACY_EID_START)->lc_pr_regulator_accuracy;
}

static uint32_t lc_pr_regulator_kid_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const float * p_value = (const float *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KID_EID_START)->lc_pr_regulator_kid = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_regulator_kid_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    float * p_value = (float *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KID_EID_START)->lc_pr_regulator_kid;
}

static uint32_t lc_pr_regulator_kiu_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const float * p_value = (const float *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KIU_EID_START)->lc_pr_regulator_kiu = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_regulator_kiu_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    float * p_value = (float *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KIU_EID_START)->lc_pr_regulator_kiu;
}

