NordicSemiconductor/nRF5-SDK-for-Mesh/models/model_spec/light_lc/src/light_lc_mc.c
static uint32_t lc_pr_regulator_kpd_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const float * p_value = (const float *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KPD_EID_START)->lc_pr_regulator_kpd = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_regulator_kpd_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    float * p_value = (float *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KPD_EID_START)->lc_pr_regulator_kpd;
}

static uint32_t lc_pr_regulator_kpu_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const float * p_value = (const float *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KPU_EID_START)->lc_pr_regulator_kpu = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_regulator_kpu_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    float * p_value = (float *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_REGULATOR_KPU_EID_START)->lc_pr_regulator_kpu;
}

static uint32_t lc_pr_time_fade_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_TIME_FADE_EID_START)->lc_pr_time_fade = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_fade_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_TIME_FADE_EID_START)->lc_pr_time_fade;
}

static uint32_t lc_pr_time_fade_on_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_TIME_FADE_ON_EID_START)->lc_pr_time_fade_on = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_fade_on_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_TIME_FADE_ON_EID_START)->lc_pr_time_fade_on;
}

static uint32_t lc_pr_time_fade_standby_auto_state_setter(mesh_config_entry_id_t id,
                                                          const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record,
                      LIGHT_LC_PR_TIME_FADE_STANDBY_AUTO_EID_START)->lc_pr_time_fade_standby_auto = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_fade_standby_auto_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record,
                                 LIGHT_LC_PR_TIME_FADE_STANDBY_AUTO_EID_START)->lc_pr_time_fade_standby_auto;
}

static uint32_t lc_pr_time_fade_standby_manual_state_setter(mesh_config_entry_id_t id,
                                                            const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record,
                      LIGHT_LC_PR_TIME_FADE_STANDBY_MANUAL_EID_START)->lc_pr_time_fade_standby_manual = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_fade_standby_manual_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record,
                                 LIGHT_LC_PR_TIME_FADE_STANDBY_MANUAL_EID_START)->lc_pr_time_fade_standby_manual;
}

static uint32_t lc_pr_time_occupancy_delay_state_setter(mesh_config_entry_id_t id,
                                                        const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_TIME_OCCUPANCY_DELAY_EID_START)->lc_pr_time_occupancy_delay = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_occupancy_delay_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_TIME_OCCUPANCY_DELAY_EID_START)->lc_pr_time_occupancy_delay;
}

static uint32_t lc_pr_time_prolong_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_TIME_PROLONG_EID_START)->lc_pr_time_prolong = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_prolong_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_TIME_PROLONG_EID_START)->lc_pr_time_prolong;
}

static uint32_t lc_pr_time_run_on_state_setter(mesh_config_entry_id_t id, const void * p_entry)
{
    const uint32_t * p_value = (const uint32_t *) p_entry;

    model_context_get(id.record, LIGHT_LC_PR_TIME_RUN_ON_EID_START)->lc_pr_time_run_on = *p_value;
    return NRF_SUCCESS;
}

static void lc_pr_time_run_on_state_getter(mesh_config_entry_id_t id, void * p_entry)
{
    uint32_t * p_value = (uint32_t *) p_entry;

    *p_value = model_context_get(id.record, LIGHT_LC_PR_TIME_RUN_ON_EID_START)->lc_pr_time_run_on;
}

/***********************************************
 * API functions to set and get flash states
 *
 * Note that a mesh config entry associates each secondary memory
 * location with a unique ID and with a setter and a getter function.
 * mesh_config_entry_set() and mesh_config_entry_get() will maintain
 * consistency (from the API caller's perspective) between values
 * in primary and secondary memory locations.
 *
 * mesh_config_entry_set() will note an update to the secondary memory
 * location associated with id, and will call the setter associated
 * with this id (by a mesh config entry) to update primary memory.
 *
 * mesh_config_entry_get() will retrieve a value from primary
 * memory by calling the getter associated with this id.
 */

uint32_t light_lc_mc_state_set(uint8_t index, light_lc_state_t lc_state, const void * p_value)
{
    uint32_t status;
    mesh_config_entry_id_t id;

    status = light_lc_state_utils_flash_id_from_lc_state(lc_state, &id);

    if (status != NRF_SUCCESS)
    {
        return status;
    }

    id.record += index;
    return mesh_config_entry_set(id, p_value);
}

uint32_t light_lc_mc_state_get(uint8_t index, light_lc_state_t lc_state, void * p_value)
{
    uint32_t status;
    mesh_config_entry_id_t id;

    status = light_lc_state_utils_flash_id_from_lc_state(lc_state, &id);

    if (status != NRF_SUCCESS)
    {
        return status;
    }

    id.record += index;
    return mesh_config_entry_get(id, p_value);
}

uint32_t light_lc_mc_open(uint8_t * p_handle)
{
    if (p_handle == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (LIGHT_LC_SETUP_SERVER_INSTANCES_MAX <= m_next_handle)
    {
        return NRF_ERROR_RESOURCES;
    }

    *p_handle = m_next_handle++;
    return NRF_SUCCESS;
}

void light_lc_mc_clear(void)
{
    lc_flash_storage_config_clear();
}

void light_lc_mc_init(void)
{
    state_contexts_all_default_set();
}
